Reports/РегистрНалоговогоУчета_ВычетыПоКурсовымРазницам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>РегистрНалоговогоУчета_ВычетыПоКурсовымРазницам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаОрганизаций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаПодразделений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/РегистрНалоговогоУчета_ВычетыПоКурсовымРазницам/Ext/ObjectModule.bsl
Перем мСписокИсточниковФинансирования Экспорт;
Перем мСписокСтруктурныхЕдиниц Экспорт;
Перем мСписокПодразделений Экспорт;
Перем мДеревоСтруктурныхЕдиниц Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;
Перем ПромежуточныеДанные Экспорт;
Перем РежимРасшифровки Экспорт;
Перем ВедётсяУчетПоПодразделениям Экспорт;
Перем мВалютаРегламентированногоУчета Экспорт;

#Если Клиент Тогда

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	СтандартныеОтчеты.ЗаполнитьДанныеОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено) Экспорт
	
	Результат.Очистить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ВыводЗаголовкаОтчета(ЭтотОбъект, Результат);
	ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных);
	//КомпоновщикНастроек.Восстановить();
	//НастройкаКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	СтандартныеОтчеты.ВывестиОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	// Выполним дополнительную обработку Результата отчета
	ОбработкаРезультатаОтчета(Результат);
	
	ВыводПодписиОтчета(ЭтотОбъект,Результат);
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(Результат, ПолучитьТекстЗаголовка(), Строка(глТекущийПользователь));
	
	Возврат;
	
КонецПроцедуры

Функция СформироватьСписокСчетов() Экспорт
	
	Списоксчетов = Новый Массив;
	
	мВидыСубконто1 = Новый Массив;
	мВидыСубконто1.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Контрагенты);
	мВидыСубконто1.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.ДенежныеСредства);
	мВидыСубконто1.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.РаботникиОрганизаций);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("мВидыСубконто",мВидыСубконто1);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Типовой.Ссылка
	|ИЗ
	|	ПланСчетов.Типовой КАК Типовой
	|ГДЕ
	|	(НЕ Типовой.ВидыСубконто.ВидСубконто.Ссылка В (&мВидыСубконто))
	|";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Списоксчетов.Добавить(Результат.ссылка);
	КонецЦикла;
		Списоксчетов.Добавить(ПланыСчетов.Типовой.КраткосрочнаяДебиторскаяЗадолженностьПредставительств);
	
	Возврат СписокСчетов;	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных) Экспорт
	
	
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Типовой.ДоходыОтКурсовойРазницы);
	СписокСчетов.Добавить(ПланыСчетов.Типовой.РасходыПоКурсовойРазнице);
	
	СписокСчетовДХ = Новый Массив;
	СписокСчетовДХ.Добавить(ПланыСчетов.Типовой.ДоходыОтКурсовойРазницы);
	
	СписокСчетовРХ = Новый Массив;
	СписокСчетовРХ.Добавить(ПланыСчетов.Типовой.РасходыПоКурсовойРазнице);
	
	мВидыСубконто1 = Новый Массив;
	мВидыСубконто1.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Контрагенты);
	
	мВидыСубконто2 = Новый Массив;
	мВидыСубконто2.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.ДенежныеСредства);
	
	мВидыСубконто3 = Новый Массив;
	мВидыСубконто3.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.РаботникиОрганизаций);
	
	СписокСчетовПрочие = СформироватьСписокСчетов();
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(НачалоПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", Дата(1, 1, 1));
	КонецЕсли;
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(КонецПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", Дата(3999, 11, 1));
	КонецЕсли;
	
	Если мДеревоСтруктурныхЕдиниц.Колонки.Количество() = 0 Тогда 
		
		СписокСтруктурныхЕдиниц = Новый СписокЗначений;
		СписокСтруктурныхЕдиниц.ЗагрузитьЗначения(мСписокСтруктурныхЕдиниц.ВыгрузитьЗначения());
		
		Для Каждого СтрПодразделение Из мСписокПодразделений Цикл 
			СписокСтруктурныхЕдиниц.Добавить(СтрПодразделение.Значение);
		КонецЦикла;		
				
		мДеревоСтруктурныхЕдиниц = СтандартныеОтчеты.СформироватьДеревоСЕ(, СписокСтруктурныхЕдиниц);
		
	КонецЕсли;
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокСчетов", СписокСчетов);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокСчетовДХ", СписокСчетовДХ);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокСчетовРХ", СписокСчетовРХ);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокСчетовПрочие", СписокСчетовПрочие);
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "мВидыСубконто1", мВидыСубконто1);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "мВидыСубконто2", мВидыСубконто2);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "мВидыСубконто3", мВидыСубконто3);
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "мВалютаРегламентированногоУчета", мВалютаРегламентированногоУчета);
	
	ТиповыеОтчеты.ДобавитьОтборПоОрганизациямИПодразделениям(КомпоновщикНастроек, мДеревоСтруктурныхЕдиниц);
	
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	СтандартныеОтчеты.ИнициализацияОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура ВыводПодписиОтчета(ОтчетОбъект,Результат)
	
	Макет = ПолучитьОбщийМакет("ЗаголовокРегистраНалоговогоУчета");
	ОбластьПодписи        = Макет.ПолучитьОбласть("Подвал");
	
	Если ОтчетОбъект <> Неопределено Тогда
		Организации                       = ОтчетОбъект.мСписокСтруктурныхЕдиниц;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организации) Тогда
		НомСтр = 0;
		Для Каждого Организация Из Организации Цикл 
			НомСтр= НомСтр + 1;
			Руководители = ОбщегоНазначения.ОтветственныеЛицаОрганизаций(Организация.Значение,КонецПериода);
		КонецЦикла;                                   		
		
		Если НомСтр >=14 Тогда
			Руководители = ОбщегоНазначения.ОтветственныеЛицаОрганизаций(Организации[0].Значение,КонецПериода);
		КонецЕсли;
		
	КонецЕсли;
	
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;
	
	ОбластьПодписи.Параметры.ФИОРуководителя	= Руководитель;
	ОбластьПодписи.Параметры.ФИОглБухгалтера 	= Бухгалтер;
	
	Результат.Вывести(ОбластьПодписи);
	
КонецПроцедуры

Процедура ВыводЗаголовкаОтчета(ОтчетОбъект, Результат)
	
	Если ОтчетОбъект <> Неопределено Тогда
		Организации                       = ОтчетОбъект.мСписокСтруктурныхЕдиниц;
	КонецЕсли;
	
	ТекстОрганизации = "";
	
	Если ЗначениеЗаполнено(Организации) Тогда
		НомСтр = 0;
		Для Каждого Организация Из Организации Цикл 
			НомСтр= НомСтр + 1;
			СведенияОбОрганизации = ОбщегоНазначения.СведенияОЮрФизЛице(Организация.Значение);
		КонецЦикла;                                   		
		
		Если НомСтр >=14 Тогда
			СведенияОбОрганизации = ОбщегоНазначения.СведенияОЮрФизЛице(Организации[0].Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	// Отбор
	ТекстОтбор = Строка(ОтчетОбъект.КомпоновщикНастроек.Настройки.Отбор);
	
	МакетЗаголовок = ПолучитьОбщийМакет("ЗаголовокРегистраНалоговогоУчета");
	ОбластьЗаголовок = МакетЗаголовок.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовок.Параметры.ЗаголовокОтчета = "Налоговый регистр по корпоративному подоходному налогу:Вычеты ";
	ОбластьЗаголовок.Параметры.ВидОтчета = "Курсовые разницы";
	
	ОбластьЗаголовок.Параметры.ПолноеНаименование	= СведенияОбОрганизации.Представление;
	//ОбластьЗаголовок.Параметры.РНН 					= СведенияОбОрганизации.РНН;
	ОбластьЗаголовок.Параметры.БИН_ИИН				= СведенияОбОрганизации.БИН_ИИН;
	ОбластьЗаголовок.Параметры.Налоговыйпериод 		= СтандартныеОтчеты.ПолучитьПредставлениеПериода(ЭтотОбъект);
	ОбластьЗаголовок.Параметры.ОписаниеНастроекОтчета 		= ТекстОтбор;
	
	Результат.Вывести(ОбластьЗаголовок);
	
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ОрганизацияВНачале = Истина) Экспорт 
		
		
КонецФункции

Процедура ОбработкаРезультатаОтчета(Результат)
	
	ТиповыеОтчеты.ОбработкаРезультатаОтчета(ЭтотОбъект, Результат);

КонецПроцедуры

// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	//ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	ЗаполнитьНачальныеНастройки();
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	
	СтруктураНастроек.Вставить("мСписокПодразделений", мСписокПодразделений);
	СтруктураНастроек.Вставить("мСписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СтруктураНастроек.Вставить("мДеревоСтруктурныхЕдиниц", мДеревоСтруктурныхЕдиниц);
	
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);

КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры


Расшифровки = Новый СписокЗначений;

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
мСписокИсточниковФинансирования = Новый СписокЗначений;
мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
мСписокПодразделений = Новый СписокЗначений;
мДеревоСтруктурныхЕдиниц = Новый ДеревоЗначений;
мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

ВедётсяУчетПоПодразделениям = ОбщегоНазначения.ПолучитьПризнакОтображенияСтруктурныхПодразделений();

РежимРасшифровки = Ложь;
